cylinderFlow/Re40-2D-simpleFoam-win/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    in
    {
        type            patch;
        nFaces          80;
        startFace       18180;
    }
    out
    {
        type            patch;
        nFaces          80;
        startFace       18260;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       18340;
    }
    sym1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       18420;
    }
    sym2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       18520;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9200;
        startFace       18620;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9200;
        startFace       27820;
    }
)

// ************************************************************************* //
